app/controllers/admin/admin_users_controller.rb

  def index
    @admin_users = AdminUser.all.paginate(:page => params[:page], per_page: 10)
---
SELECT COUNT(*) FROM `admin_users`
SELECT `admin_users`.* FROM `admin_users`

  def create
    @admin_user = AdminUser.new(admin_user_params)
    @admin_user.password = SecureRandom.urlsafe_base64
    if @admin_user.save
---
INSERT INTO `admin_users` (`name`, `email`, `encrypted_password`, `created_at`, `updated_at`, `confirmation_token`, `confirmation_sent_at`) VALUES ('Jose Reynoso', 'juan.reyes@tektonlabs.com', '$2a$10$1729iyznxt7GYHApYYYUgeesBsFE5FdkiwhX2Pxg1IHwe7VSHlGyC', '2015-03-05 18:35:35.481984', '2015-03-05 18:35:35.481984', '951d129af0e9e603ba09cd50a435bd9aab951709aea17ce7526632bd25ff396b', '2015-03-05 18:35:35.691858')

    def set_admin_user
      @admin_user = AdminUser.find(params[:id])
---
SELECT  `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1  ORDER BY `admin_users`.`id` ASC LIMIT 1