app/views/admin/dashboard/index.html.erb

SELECT COUNT(*) FROM `admin_users`
---
						<div class="col-xs-9 text-right">
							<div class="huge"><%= AdminUser.count %></div>